
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ОбъектБП = РеквизитФормыВЗначение("Объект");
	Карта = ОбъектБП.ПолучитьКартуМаршрута();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНажатие(Элемент, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура("Ключ", Объект.Заявка);
	ОткрытьФорму("Документ.ЗаявкаНаВыдачуПропуска.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры
