
&НаКлиенте
Процедура ОткрытьПроцессСогласования(Команда)
	БП = ТекущийБизнесПроцесс();
	
	Если Не БП = Неопределено Тогда
		ПараметрыФормы = Новый Структура("Ключ", БП);
		ОткрытьФорму("БизнесПроцесс.СогласованиеВыдачиПропуска.Форма.ФормаБизнесПроцесса", ПараметрыФормы);
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Процесс согласования еще не запущен";
		Сообщение.Сообщить();
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Функция ТекущийБизнесПроцесс()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СогласованиеВыдачиПропуска.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.СогласованиеВыдачиПропуска КАК СогласованиеВыдачиПропуска
		|ГДЕ
		|	СогласованиеВыдачиПропуска.Заявка = &Заявка
		|	И НЕ СогласованиеВыдачиПропуска.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе 
		Результат = Неопределено;	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура СогласоватьНаСервере()
	БП = БизнесПроцессы.СогласованиеВыдачиПропуска.СоздатьБизнесПроцесс();
	БП.Дата = ТекущаяДата();
	БП.Заявка = Объект.Ссылка;
	БП.Посетитель = Объект.Посетитель;
	БП.Записать();
	БП.Старт();
	Объект.Статус = Перечисления.СтатусыЗаявокНаВыдачуПропуска.НаСогласовании;
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	Если Параметры.Ключ.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Документ не записан!";
		Сообщение.Сообщить();
	КонецЕсли;
	СогласоватьНаСервере();
	Элементы.ФормаСогласовать.Доступность = Ложь;
	Элементы.СтатусЗаявки.Заголовок = Объект.Статус;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Запущен процесс согласования выдачи пропуска";
	Сообщение.Сообщить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Ключ.Пустая() Тогда
		Бессрочно = Не (Объект.КонецПериодаДействия = Дата(1,1,1));
		Элементы.КонецПериодаДействия.Доступность = Не Бессрочно;
		РедактированиеРазрешено = (Объект.Статус = Перечисления.СтатусыЗаявокНаВыдачуПропуска.Создано);
		Элементы.ФормаСогласовать.Доступность = РедактированиеРазрешено;
		Элементы.Организация.ТолькоПросмотр	  = РедактированиеРазрешено;
		Элементы.Посетитель.ТолькоПросмотр	  = РедактированиеРазрешено;
		Элементы.ЦельПосещения.ТолькоПросмотр = РедактированиеРазрешено;	
	Иначе
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.Статус = Перечисления.СтатусыЗаявокНаВыдачуПропуска.Создано;	
	КонецЕсли;
	
	Элементы.СтатусЗаявки.Заголовок = Объект.Статус;	
КонецПроцедуры


&НаКлиенте
Процедура БессрочноПриИзменении(Элемент)
	Элементы.КонецПериодаДействия.Доступность = Не Бессрочно;
КонецПроцедуры	