
&НаСервере
Процедура СоздатьТочкуИОчередьНаСервере()
	Попытка
		МакетВнешнейКомпоненты    = "ОбщийМакет.PinkRabbitMQ";
		КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			МакетВнешнейКомпоненты,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
			
		Компонента = Новый("AddIn.BITERP.PinkRabbitMQ");	
		
		Компонента.Connect(Объект.Адрес, Объект.Порт, Объект.Логин, Объект.Пароль, Объект.ВиртуальныйХост);
		ТочкаОбмена = Объект.ТочкаОбмена;
		ИмяОчереди  = Объект.ИмяОчереди;
		
		Компонента.DeclareExchange(ТочкаОбмена, "topic", Ложь, Истина, Ложь);
		Компонента.DeclareQueue(ИмяОчереди, Ложь, Ложь, Ложь, Ложь);
		Компонента.BindQueue(ИмяОчереди, ТочкаОбмена, "#" + ИмяОчереди + "#");
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка создания точек и очередей!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Точки и очереди успешно созданы!";
	Сообщение.Сообщить();		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТочкуИОчередь(Команда)
	СоздатьТочкуИОчередьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	Попытка 
		МакетВнешнейКомпоненты    = "ОбщийМакет.PinkRabbitMQ";
		КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			МакетВнешнейКомпоненты,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
			
		Компонента = Новый("AddIn.BITERP.PinkRabbitMQ");	
		
		Компонента.Connect(Объект.Адрес, Объект.Порт, Объект.Логин, Объект.Пароль, Объект.ВиртуальныйХост); 
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Подключено";
		Сообщение.Сообщить();
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();	
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеНаСервере();
КонецПроцедуры
