#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ДобавитьТестовыйНабор("Документ Заявка на выдачу пропуска: проверка записи").ВТранзакции()
		.ДобавитьТест("ПроверкаЗаписиПозитив")
		.ДобавитьТест("ПроверкаЗаписиНегатив")
	;
	
КонецПроцедуры

Процедура ПроверкаЗаписиПозитив() Экспорт
	
	Организация = СозданиеОрганизации();
	Посетитель  = СозданиеФизЛица();
	
	НоваяЗаявка = СозданиеЗаявкиНаВыдачуПропуска(Организация, Посетитель, '20260410', '20260420').Записать();
	
	ЮТест.ОжидаетЧто(НоваяЗаявка)
		.ИмеетТип("ДокументСсылка.ЗаявкаНаВыдачуПропуска")
		;
	
КонецПроцедуры

Процедура ПроверкаЗаписиНегатив() Экспорт
	
	Организация = СозданиеОрганизации();
	Посетитель  = СозданиеФизЛица();
	
	НоваяЗаявка = СозданиеЗаявкиНаВыдачуПропуска(Организация, Посетитель, '20260410', '20260420').Записать();
	НоваяЗаявка2 = СозданиеЗаявкиНаВыдачуПропуска(Организация, Посетитель, '20260415', '20260425');
	
	ЮТест.ОжидаетЧто(НоваяЗаявка2)
		.Метод("Записать", ЮтМетоды.МассивПараметров(РежимЗаписиДокумента.Запись))
		.ВыбрасываетИсключение("Не удалось записать: ""Заявка на выдачу пропуска""!");
	;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СозданиеОрганизации()
	
	КонструкторОрганизации = ЮТест.Данные().КонструкторОбъекта("Справочник.Организации")
		.ФикцияОбязательныхПолей()
		;
		
	ОрганизацияНовая = КонструкторОрганизации.Записать();
	
	Возврат ОрганизацияНовая;	
	
КонецФункции

Функция СозданиеФизЛица()
	
	КонструкторФизЛица = ЮТест.Данные().КонструкторОбъекта("Справочник.ФизическиеЛица")
		.ФикцияОбязательныхПолей()
		;
		
	ФизЛицоНовое = КонструкторФизЛица.Записать();
	
	Возврат ФизЛицоНовое;	
	
КонецФункции

Функция СозданиеЗаявкиНаВыдачуПропуска (Организация, Посетитель, НачалоПериода, КонецПериода)
	
	КонструкторДокумента = ЮТест.Данные().КонструкторОбъекта("Документ.ЗаявкаНаВыдачуПропуска")
		.ФикцияОбязательныхПолей()
		.Установить("Посетитель", Посетитель)
		.Установить("Организация", Организация)
		.Установить("НачалоПериодаДействия", НачалоПериода)
		.Установить("КонецПериодаДействия", КонецПериода)
		.Установить("Статус", Перечисления.СтатусыЗаявокНаВыдачуПропуска.Создано)
		;
		
	Возврат КонструкторДокумента;	
	
КонецФункции	

#КонецОбласти
