
&НаСервереБезКонтекста
Процедура ЗагрузитьСообщенияНаСервере()
	Настройки = Справочники.НастройкиПодключенияRabbit.Выбрать();
	Если НЕ Настройки.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка 
		МакетВнешнейКомпоненты    = "ОбщийМакет.PinkRabbitMQ";
		КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			МакетВнешнейКомпоненты,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
			
		Компонента = Новый("AddIn.BITERP.PinkRabbitMQ");	
		
		Компонента.Connect(Настройки.Адрес, Настройки.Порт, Настройки.Логин, Настройки.Пароль, Настройки.ВиртуальныйХост);
		
		Попытка
			Компонента.DeclareQueue(Настройки.ИмяОчереди, Ложь, Ложь, Ложь, Ложь);
			
			Потребитель = Компонента.BasicConsume(Настройки.ИмяОчереди, "", Истина, Ложь, 0);
			
			ОтветноеСообщение = "";
			Пока Компонента.BasicConsumeMessage("", ОтветноеСообщение, 5) Цикл
				Компонента.BasicAck();
				ЗагруженныйОбъект = ОбработатьСообщение(ОтветноеСообщение);
				
				НаборЗаписей = РегистрыСведений.ОчередьВыгрузкиСообщений.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ВыгружаемыйОбъект.Установить(ЗагруженныйОбъект);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать();
				ОтветноеСообщение = "";
			КонецЦикла;	
			Компонента.BasicCancel("");		
		Исключение
			ВызватьИсключение Компонента.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
		 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСообщения(Команда)
	ЗагрузитьСообщенияНаСервере();
	Элементы.ОчередьСообщений.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьСообщенияНаСервере()
	Настройки = Справочники.НастройкиПодключенияRabbit.Выбрать();
	Если НЕ Настройки.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка 
		МакетВнешнейКомпоненты    = "ОбщийМакет.PinkRabbitMQ";
		КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			МакетВнешнейКомпоненты,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
			
		Компонента = Новый("AddIn.BITERP.PinkRabbitMQ");	
		
		Компонента.Connect(Настройки.Адрес, Настройки.Порт, Настройки.Логин, Настройки.Пароль, Настройки.ВиртуальныйХост); 
		
		Набор = РегистрыСведений.ОчередьВыгрузкиСообщений.СоздатьНаборЗаписей();
		Набор.Прочитать();
		
		Для Каждого Запись Из Набор Цикл
			ТекстСообщения = СформироватьТекстСообщения(Запись.ВыгружаемыйОбъект);
				
			Компонента.BasicPublish(
				Настройки.ТочкаОбмена,
				"#" + Настройки.ИмяОчереди + "#",
				ТекстСообщения,
				1,
				Ложь);		
		КонецЦикла
								 
	Исключение
		ЗаписьЖурналаРегистрации("Подключение компоненты PinkRabbit", 
								 УровеньЖурналаРегистрации.Ошибка,
								 ,
								 ,
								 ОписаниеОшибки());
	КонецПопытки;							 

КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьТекстСообщения(ВыгружаемыйОбъект)

	СтрокаJSON = "";
	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	Сериализатор.ЗаписатьJSON(Запись, ВыгружаемыйОбъект, НазначениеТипаXML.Явное);
	СтрокаJSON = СтрокаJSON + Запись.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбработатьСообщение(Сообщение)

	СтрокаJSON = "";
	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Сообщение);
	Данные = Сериализатор.ПрочитатьJSON(Чтение, Тип("ДокументСсылка.ЗаявкаНаВыдачуПропуска"));
	Чтение.Закрыть();
	
	Возврат Данные;
	
КонецФункции


&НаКлиенте
Процедура ВыгрузитьСообщения(Команда)
	ВыгрузитьСообщенияНаСервере();
КонецПроцедуры
