
Процедура РаспечататьПропускПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	НаборЗаписей = РегистрыСведений.ОчередьВыгрузкиСообщений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВыгружаемыйОбъект.Установить(Заявка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		НовЗапись = НаборЗаписей.Добавить();
		НовЗапись.ВыгружаемыйОбъект = Заявка;
		НаборЗаписей.Записать();
	КонецЕсли;	
КонецПроцедуры

Процедура УсловиеПроверкаУсловия(ТочкаМаршрута, Результат)
	Результат = РазрешенаВыдачаПропуска;
КонецПроцедуры

Процедура ДействиеПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого НоваяЗадача Из ФормируемыеЗадачи Цикл
		НоваяЗадача.Наименование = ТочкаМаршрута.НаименованиеЗадачи + " " + Строка(Заявка.Посетитель); 
	КонецЦикла;	
КонецПроцедуры

