
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Отказ = ПроверитьНаНаличиеДействующегоПропуска(Посетитель, НачалоПериодаДействия, КонецПериодаДействия, Ссылка);
КонецПроцедуры

Функция ПроверитьНаНаличиеДействующегоПропуска(Посетитель, НачалоПериодаДействия, КонецПериодаДействия, Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаНаВыдачуПропуска.Ссылка
	               |ИЗ
	               |	Документ.ЗаявкаНаВыдачуПропуска КАК ЗаявкаНаВыдачуПропуска
	               |ГДЕ
	               |	ЗаявкаНаВыдачуПропуска.Посетитель = &Посетитель
	               |	И Не ЗаявкаНаВыдачуПропуска.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВыдачуПропуска.Согласовано)
	               |	И Не ЗаявкаНаВыдачуПропуска.ПометкаУдаления
	               |	И ЗаявкаНаВыдачуПропуска.Ссылка <> &Ссылка
	               |	И 
	               |	ВЫбор Когда &КонецПериодаДействия = ДатаВремя(1,1,1)
	               |	Тогда
	               |		ЗаявкаНаВыдачуПропуска.КонецПериодаДействия >= &НачалоПериодаДействия
	               |	Иначе	
	               |		ЗаявкаНаВыдачуПропуска.КонецПериодаДействия Между &НачалоПериодаДействия И &КонецПериодаДействия
	               |	Конец";
	Запрос.УстановитьПараметр("Посетитель", Посетитель);
	Запрос.УстановитьПараметр("НачалоПериодаДействия", НачалоПериодаДействия);
	Запрос.УстановитьПараметр("КонецПериодаДействия", КонецПериодаДействия);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У посетителя " + Посетитель + " уже есть действующий пропуск, выданный по заявке " + Выборка.Ссылка;
		Сообщение.Сообщить();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
