
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = Объект.Выполнена;
	Элементы.Отклонить.Доступность = НЕ Объект.Выполнена;
	Элементы.Согласовать.Доступность = Не Объект.Выполнена;
	Посетитель = Объект.БизнесПроцесс.Посетитель;
	Если Объект.ТочкаМаршрута = БизнесПроцессы.СогласованиеВыдачиПропуска.ТочкиМаршрута.СогласоватьВыдачуПропуска Тогда
		ЭтотОбъект.Описание = "Прошу согласовать выдачу пропуска посетителю " + Посетитель;
		Элементы.Отклонить.Видимость   = Истина;
		Элементы.Согласовать.Заголовок = "Согласовать";
	ИначеЕсли Объект.ТочкаМаршрута = БизнесПроцессы.СогласованиеВыдачиПропуска.ТочкиМаршрута.ОзнакомитьсяСрезультатомСогласованияОтклонено Тогда
		ЭтотОбъект.Описание = "Сообщить об отказе в выдаче пропуска посетителю " + Посетитель;	
	ИначеЕсли Объект.ТочкаМаршрута = БизнесПроцессы.СогласованиеВыдачиПропуска.ТочкиМаршрута.РаспечататьПропуск Тогда
		ЭтотОбъект.Описание = "Распечатать пропуск для посетителя " + Посетитель;
	Иначе
		ЭтотОбъект.Описание = "Передать пропуск посетителю " + Посетитель;	
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНаСервере()
	ЗадачаОбъект = РеквизитФормыВЗначение("Объект");
	ЗадачаОбъект.Записать();
	
	БПОбъект = Объект.БизнесПроцесс.ПолучитьОбъект();
	БПОбъект.РазрешенаВыдачаПропуска = Ложь;
	БПОбъект.Записать();
	
	ЗаявкаОбъект = Объект.БизнесПроцесс.Заявка.ПолучитьОбъект();
	ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаВыдачуПропуска.Отклонено;
	ЗаявкаОбъект.Записать();
	
	
	ЗадачаОбъект.ВыполнитьЗадачу();
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ОтклонитьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере()
	ЗадачаОбъект = РеквизитФормыВЗначение("Объект");
	ЗадачаОбъект.Записать();
	
	Если Объект.ТочкаМаршрута = БизнесПроцессы.СогласованиеВыдачиПропуска.ТочкиМаршрута.СогласоватьВыдачуПропуска Тогда
		БПОбъект = Объект.БизнесПроцесс.ПолучитьОбъект();
		БПОбъект.РазрешенаВыдачаПропуска = Истина;
		БПОбъект.Записать();
		
		ЗаявкаОбъект = Объект.БизнесПроцесс.Заявка.ПолучитьОбъект();
		ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаВыдачуПропуска.Согласовано;
		ЗаявкаОбъект.Записать();	
	КонецЕсли;	
	
	
	ЗадачаОбъект.ВыполнитьЗадачу();
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	СогласоватьНаСервере();
	Закрыть();
КонецПроцедуры
